Repository: hanan-khateb/Final-Project-Flutter-course
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Mental Health
ar: الصحة النفسية

# short_description
source: mental health care application
ar: تطبيق رعاية الصحة العقلية

source: Sign In
ar: تسجيل الدخول

# creat_acount
source: Creat Account
ar: إنشاء حساب

source: skip
ar: تخطي

source: previous
ar: السابق

# Select_doctor
source: Select your doctor
ar: اختر طبيبك من فضلك

source: About App
ar: حول التطبيق

# using
source: Instructions for use
ar: تعليمات الاستخدام

source: Sign Up
ar: إنشاء حساب

# callingCenter
source: Customer Service Center
ar: مركز خدمة الزبائن

source: Log In
ar: تسجيل الدخول

source: Language
ar: اللغة

source: English
ar: الانكليزية

source: Arabic
ar: العربية

source: Change Password
ar: تغيير كلمة السر

source: Log Out
ar: تسجيل الخروج

source: Next
ar: التالي

source: Cancel
ar: إلغاء

source: Full Name
ar: الاسم الكامل

# welcome1
source: Welcome in mental health care application
ar: أهلاً بك في تطبيق العناية بالصحة النفسية

# welcome2
source: Because the safety of your mental health matters to us
ar: لأن سلامة صحتك النفسية تهمنا

# welcome3
source: You will be able to communicate with the best doctors
ar: سوف نؤمن لك التواصل مع أفضل الأطباء

# welcome4
source: You can communicate with doctors while you are at home
ar: يمكنك التواصل مع الأطباء وأنت في منزلك

# welcome5
source: Doctors will give you appropriate directions for your health
ar: سيقوم الأطباء بالتواصل معك وإعطائك التوجيهات المناسبة لصحتك

# welcome6
source: we wish you a speedy recovery
ar: نتمنى لك الشفاء العاجل

source: User name
ar: اسم المستخدم

source: Password
ar: كلمة السر

source: Age
ar: العمر

source: Phone
ar: رقم الهاتف

source: Email
ar: البريد الالكتروني

source: submit
ar: إرسال

source: Forgot your password ?
ar: هل نسيت كلمة السر ؟

# do_not_have_an_account
source: Don't have an account ?
ar: ليس لديك حساب ؟

source: have an account ?
ar: هل لديك حساب ؟

# b1b1
source: I do not feel sad
ar: لا أشعر بالحزن

# b1b2
source: I feel sad
ar: أشعر أنني حزين

# b1b3
source: I am sad all the time and I can't snap out of it
ar: أنا حزين طوال الوقت ولا أستطيع التخلص من هذا الشعور

# b1b4
source: I am so sad and unhappy that I can't stand it.
ar: أنا حزين للغاية وغير سعيد لدرجة أنني لا أستطيع تحمل هذا

# b2b1
source: I am not particularly discouraged about the future
ar: لا أشعر بالإحباط حيال المستقبل

# b2b2
source: I feel discouraged about the future
ar: أشعر بالإحباط تجاه المستقبل

# b2b3
source: I feel I have nothing to look forward to
ar: أشعر أنه ليس لدي ما أتطلع إليه

# b2b4
source: I feel the future is hopeless and that things cannot improve
ar: أشعر أن المستقبل ميؤوس منه وأن الأمور لا يمكن أن تتحسن

# b3b1
source: I do not feel like a failure
ar: لا أشعر بالفشل

# b3b2
source: I feel I have failed more than the average person.
ar: أشعر أنني فشلت أكثر من الشخص العادي

# b3b3
source: As I look back on my life, all I can see is a lot of failures
ar: عندما أنظر إلى حياتي ، كل ما يمكنني رؤيته هو الكثير من الإخفاقات

# b3b4
source: I feel I am a complete failure as a person
ar: أشعر أنني شخص فاشل تماماً

# b4b1
source: I get as much satisfaction out of things as I used to
ar: أشعر بالرضا عن الأشياء كما اعتدت

# b4b2
source: I don't enjoy things the way I used to
ar: لا أستمتع بالأشياء بالطريقة التي اعتدت عليها

# b4b3
source: I don't get real satisfaction out of anything anymore
ar: لم أعد أشعر بالرضا الحقيقي عن أي شيء

# b4b4
source: I am dissatisfied or bored with everything
ar: أشعر بعدم الرضا أو الملل من كل شيء

# b5b1
source: I don't feel particularly guilty
ar: لا أشعر بالذنب بشكل خاص

# b5b2
source: I feel guilty a good part of the time
ar: أشعر بالذنب في جزء كبير من الوقت

# b5b3
source: I feel quite guilty most of the time
ar: أشعر بالذنب معظم الوقت

# b5b4
source: I feel guilty all of the time
ar: أشعر بالذنب طوال الوقت

# b6b1
source: I don't feel I am being punished
ar: لا أشعر أنني أعاقب

# b6b2
source: I feel I may be punished
ar: أشعر أنني قد أعاقب

# b6b3
source: I expect to be punished.
ar: أتوقع أن أعاقب

# b6b4
source: I feel I am being punished
ar: أشعر بأنني أعاقب

# b7b1
source: I don't feel disappointed in myself
ar: لا أشعر بخيبة أمل في نفسي

# b7b2
source: I am disappointed in myself
ar: أشعر بخيبة أمل في نفسي

# b7b3
source: I am disgusted with myself
ar: أشعر بالاشمئزاز من نفسي

# b7b4
source: I hate myself
ar: أنا أكره نفسي

# b8b1
source: I don't feel I am any worse than anybody else
ar: لا أشعر أنني أسوأ من أي شخص آخر

# b8b2
source: I am critical of myself for my weaknesses or mistakes
ar: أنتقد نفسي بسبب نقاط ضعفي أو أخطائي

# b8b3
source: I blame myself all the time for my faults
ar: ألوم نفسي طوال الوقت على أخطائي

# b8b4
source: I blame myself for everything bad that happens
ar: ألوم نفسي على كل شيء سيء يحدث

# b9b1
source: I don't have any thoughts of killing myself
ar: ليس لدي أي أفكار لقتل نفسي

# b9b2
source: I have thoughts of killing myself, but I would not carry them out
ar: لدي أفكار بقتل نفسي ، لكنني لن أفعلها

# b9b3
source: I would like to kill myself
ar: أود أن أقتل نفسي

# b9b4
source: I would kill myself if I had the chance
ar: سأقتل نفسي إذا سنحت لي الفرصة

# b10b1
source: I don't cry any more than usual
ar: لا أبكي أكثر من المعتاد

# b10b2
source: I cry more now than I used to
ar: أبكي الآن أكثر مما اعتدت عليه

# b10b3
source: I cry all the time now
ar: أبكي طوال الوقت الآن

# b10b4
source: I used to be able to cry, but now I can't cry even though I want to
ar: كنت قادرًا على البكاء ، لكنني الآن لا أستطيع البكاء رغم أنني أريد ذلك

# b11b1
source: I am no more irritated by things than I ever was
ar: لست منزعجًا من الأشياء أكثر من أي وقت مضى

# b11b2
source: I am slightly more irritated now than usual
ar: أشعر الآن بالغضب أكثر قليلاً من المعتاد

# b11b3
source: I am quite annoyed or irritated a good deal of the time.
ar: أشعر بالانزعاج أو الغضب الشديد لوقت طويل

# b11b4
source: I feel irritated all the time
ar: أشعر بالغضب طوال الوقت

# b12b1
source: I have not lost interest in other people
ar: لم أفقد الاهتمام بالآخرين

# b12b2
source: I am less interested in other people than I used to be
ar: أنا أقل اهتماما بالآخرين مما كنت عليه في السابق

# b12b3
source: I have lost most of my interest in other people
ar: فقدت معظم اهتمامي بالآخرين

# b12b4
source: I have lost all of my interest in other people
ar: فقدت كل اهتمامي بالآخرين

# b13b1
source: I make decisions about as well as I ever could
ar: أنا أتخذ قرارات بشأن أفضل ما أستطيع

# b13b2
source: I put off making decisions more than I used to
ar: أؤجل اتخاذ القرارات أكثر مما كنت أفعله

# b13b3
source: I have greater difficulty in making decisions more than I used to
ar: أجد صعوبة أكبر في اتخاذ القرارات أكثر مما اعتدت عليه

# b13b4
source: I can't make decisions at all anymore
ar: لا يمكنني اتخاذ قرارات على الإطلاق

# b14b1
source: I don't feel that I look any worse than I used to
ar: لا أشعر أنني أبدو أسوأ مما كنت عليه في السابق

# b14b2
source: I am worried that I am looking old or unattractive
ar: أشعر بالقلق من أن أبدو عجوزًا أو غير جذاب

# b14b3
source: I feel there are permanent changes in my appearance that make me look unattractive
ar: أشعر أن هناك تغييرات دائمة في مظهري تجعلني أبدو غير جذاب

# b14b4
source: I believe that I look ugly
ar: أعتقد أنني أبدو قبيحًا

# b15b1
source: I can work about as well as before
ar: يمكنني العمل كما كان من قبل

# b15b2
source: It takes an extra effort to get started at doing something
ar: يتطلب الأمر جهداً إضافياً للبدء في فعل شيء ما

# b15b3
source: I have to push myself very hard to do anything
ar: عليّ أن أدفع نفسي بقوة لفعل أي شيء

# b15b4
source: I can't do any work at all
ar: لا أستطيع القيام بأي عمل على الإطلاق

# b16b1
source: I can sleep as well as usual
ar: أستطيع أن أنام كالمعتاد

# b16b2
source: I don't sleep as well as I used to
ar: أنا لا أنام كما اعتدت

# b16b3
source: I wake up 1-2 hours earlier than usual and find it hard to get back to sleep
ar: أستيقظ أبكر من المعتاد بساعتين أو ساعتين وأجد صعوبة في العودة إلى النوم

# b16b4
source: I wake up several hours earlier than I used to and cannot get back to sleep
ar: أستيقظ أبكر بعدة ساعات مما اعتدت عليه ولا أستطيع العودة إلى النوم

# b17b1
source: I don't get more tired than usual
ar: لا أشعر بالتعب أكثر من المعتاد

# b17b2
source: I get tired more easily than I used to
ar: أشعر بالتعب بسهولة أكبر مما اعتدت عليه

# b17b3
source: I get tired from doing almost anything
ar: تعبت من فعل أي شيء تقريباً

# b17b4
source: I am too tired to do anything
ar: أنا متعب جداً ولا يمكنني فعل أي شيء

# b18b1
source: My appetite is no worse than usual
ar: شهيتي للطعام ليست أسوأ من المعتاد

# b18b2
source: My appetite is not as good as it used to be
ar: شهيتي للطعام ليست جيدة كما كانت من قبل

# b18b3
source: My appetite is much worse now
ar: شهيتي للطعام أسوأ بكثير الآن

# b18b4
source: I have no appetite at all anymore
ar: ليس لدي شهية على الإطلاق

# b19b1
source: I haven't lost much weight, if any, lately
ar: لم أفقد الكثير من الوزن ، إن وجد ، مؤخراً

# b19b2
source: I have lost more than five pounds
ar: فقدت أكثر من خمسة أرطال

# b19b3
source: I have lost more than ten pounds
ar: فقدت أكثر من عشرة أرطال

# b19b4
source: I have lost more than fifteen pounds
ar: فقدت أكثر من خمسة عشر رطلاً

# b20b1
source: I am no more worried about my health than usual
ar: أنا لست قلقاً على صحتي أكثر من المعتاد

# b20b2
source: I am worried about physical problems like aches, pains, upset stomach, or constipation
ar: أنا قلق من مشاكل جسدية مثل الأوجاع والآلام واضطراب المعدة أو الإمساك

# b20b3
source: I am very worried about physical problems and it's hard to think of much else
ar: أنا قلق للغاية بشأن المشاكل الجسدية ومن الصعب التفكير في أشياء أخرى

# b20b4
source: I am so worried about my physical problems that I cannot think of anything else
ar: أنا قلق للغاية بشأن مشاكلي الجسدية لدرجة أنني لا أستطيع التفكير في أي شيء آخر

# b21b1
source: I have not noticed any recent change in my interest in sex
ar: لم ألحظ أي تغيير حديث في اهتمامي بالعلاقات العاطفية

# b21b2
source: I am less interested in sex than I used to be
ar: أنا أقل اهتماماً بالعلاقات العاطفية مما كنت عليه في السابق

# b21b3
source: I have almost no interest in sex
ar: لا أهتم بالعلاقات العاطفية تقريباً

# b21b4
source: I have lost interest in sex completely
ar: لقد فقدت الاهتمام بالعلاقات العاطفية تماماً
